ISSUE_FILTER_PROMPT = """
你是一位经验丰富的软件工程师，你需要评估Issue质量，判断Issue是否包含足够信息，以便工程师能够无歧义地给出解决方案。

**Issue评分标准**
满分为10分，其中10分表示质量非常好(issue描述清晰，解决方案所需条件明确)，0分表示质量非常差(无法理解需要解决的问题是什么)
注：无法根据Issue实现解决方案的，评分不应高于5分

扣分项核查需要逐条解释是否存在扣分，如果发现issue存在问题或者违反了评分标准请及时指出，并在后续的评估中进行扣分。
以下是重要扣分项（违反一项扣5分）：
1. 关键信息缺失
    缺少预期结果：未说明代码修复后系统应有的正确行为或输出；涉及数据处理时，未提供输入示例及期望/错误输出
    缺乏重现步骤：未提供重现问题的操作流程或可运行的代码示例
    遗漏版本信息：未提供使用的库、框架、操作系统及相关软件的具体版本号；跨平台问题未明确环境细节
    错误日志不完整：仅提供错误信息片段，缺少关键的上下文或堆栈跟踪
2、非Issue类型提交
    误用 PR 描述：将 Pull Request (PR) 的说明性文字直接作为 Issue
    已解决问题：Issue 所描述的问题已被修复或关闭
    非问题咨询：内容涉及代码版本发布计划、未来功能咨询等，而非实际的缺陷报告或功能描述

以下是常见扣分项（根据严重程度酌情扣分）：
1、Issue表述不清
    问题混杂：单个 Issue 包含多个无关问题，或问题描述本身存在逻辑矛盾
    术语未定义：使用了未加解释的项目专有名词或缩写
    要求未量化：使用模糊描述（如“合理的默认值”、“用户友好”、“速度更快”、“更高效”），缺乏可衡量的验收标准，或未清晰界定问题的具体范围或边界
    测试用例低质(如果有)：提供的测试用例不充分、过于宽泛、缺失或要求不足（通过测试用例并不能够表明issue得到解决）
2、过度依赖外部资源
    核心信息依赖外部链接：关键问题描述、日志或重现步骤存放在可能失效或无法访问的外部链接中
    依赖私有仓库：问题重现依赖于非公开的代码库，导致他人无法验证


**内容如下**
Issue
{issue}


请提供你的专业评估分析并直接输出一个数字(严格按照以下格式输出)：
reason for evaluation:xxx
issue score:0-10

"""